country_name_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://kirillkotov.com/soapspringbootlect/dto">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryNameRequest>
            <gs:name>Russia</gs:name>
        </gs:getCountryNameRequest>
    </soapenv:Body>
</soapenv:Envelope>